nghtsnw/stlink_mdr32/src/stlink-lib/flash_loader.c
/*
 * File: flash_loader.c
 *
 * Flash loaders
 */

#include <stdint.h>
#include <stdio.h>
#include <string.h>
#include <unistd.h>

#include <stm32.h>
#include <stlink.h>
#include "flash_loader.h"

#include "common_flash.h"
#include "helper.h"
#include "logging.h"
#include "read_write.h"
#include "register.h"

#define FLASH_REGS_BANK2_OFS      0x40
#define FLASH_BANK2_START_ADDR    0x08080000

#define STM32F0_WDG_KR            0x40003000
#define STM32H7_WDG_KR            0x58004800

#define STM32F0_WDG_KR_KEY_RELOAD 0xAAAA

/*
 * !!! DO NOT MODIFY FLASH LOADERS DIRECTLY !!!
 *
 * Edit assembly files in the '/flashloaders' instead. The sizes of binary
 * flash loaders must be aligned by 4 (it's written by stlink_write_mem32)
 */

// flashloaders/stm32f0.s -- compiled with thumb2
static const uint8_t loader_code_stm32vl[] = {
    0x00, 0xbf, 0x00, 0xbf,
    0x09, 0x4f, 0x1f, 0x44,
    0x09, 0x4d, 0x3d, 0x44,
    0x04, 0x88, 0x0c, 0x80,
    0x02, 0x30, 0x02, 0x31,
    0x4f, 0xf0, 0x01, 0x07,
    0x2c, 0x68, 0x3c, 0x42,
    0xfc, 0xd1, 0x4f, 0xf0,
    0x14, 0x07, 0x3c, 0x42,
    0x01, 0xd1, 0x02, 0x3a,
    0xf0, 0xdc, 0x00, 0xbe,
    0x00, 0x20, 0x02, 0x40,
    0x0c, 0x00, 0x00, 0x00
};

// flashloaders/stm32f0.s -- thumb1 only, same sequence as for STM32VL, bank ignored
static const uint8_t loader_code_stm32f0[] = {
    0xc0, 0x46, 0xc0, 0x46,
    0x08, 0x4f, 0x1f, 0x44,
    0x08, 0x4d, 0x3d, 0x44,
    0x04, 0x88, 0x0c, 0x80,
    0x02, 0x30, 0x02, 0x31,
    0x06, 0x4f, 0x2c, 0x68,
    0x3c, 0x42, 0xfc, 0xd1,
    0x05, 0x4f, 0x3c, 0x42,
    0x01, 0xd1, 0x02, 0x3a,
    0xf2, 0xdc, 0x00, 0xbe,
    0x00, 0x20, 0x02, 0x40,
    0x0c, 0x00, 0x00, 0x00,
    0x01, 0x00, 0x00, 0x00,
    0x14, 0x00, 0x00, 0x00
};

// flashloaders/stm32lx.s -- compiled for armv6-m for compatibility with both
// armv6-m cores (STM32L0) and armv7-m cores (STM32L1)
static const uint8_t loader_code_stm32lx[] = {
    0x04, 0x68, 0x0c, 0x60,
    0x04, 0x30, 0x04, 0x31,
    0x04, 0x3a, 0xf9, 0xdc,
    0x00, 0xbe, 0x00, 0x00
};

// flashloaders/stm32f4.s
static const uint8_t loader_code_stm32f4[] = {
    0xdf, 0xf8, 0x24, 0xc0,
    0xdf, 0xf8, 0x24, 0xa0,
    0xe2, 0x44, 0x04, 0x68,
    0x0c, 0x60, 0x00, 0xf1,
    0x04, 0x00, 0x01, 0xf1,
    0x04, 0x01, 0xba, 0xf8,
    0x00, 0x40, 0x14, 0xf0,
    0x01, 0x0f, 0xfa, 0xd1,
    0x04, 0x3a, 0xf2, 0xdc,
    0x00, 0xbe, 0x00, 0xbf,
    0x00, 0x3c, 0x02, 0x40,
    0x0e, 0x00, 0x00, 0x00
};

// flashloaders/stm32f4lv.s
static const uint8_t loader_code_stm32f4_lv[] = {
    0xdf, 0xf8, 0x24, 0xc0,
    0xdf, 0xf8, 0x24, 0xa0,
    0xe2, 0x44, 0x04, 0x78,
    0x0c, 0x70, 0x00, 0xf1,
    0x01, 0x00, 0x01, 0xf1,
    0x01, 0x01, 0xba, 0xf8,
    0x00, 0x40, 0x14, 0xf0,
    0x01, 0x0f, 0xfa, 0xd1,
    0x01, 0x3a, 0xf2, 0xdc,
    0x00, 0xbe, 0x00, 0xbf,
    0x00, 0x3c, 0x02, 0x40,
    0x0e, 0x00, 0x00, 0x00
};

// flashloaders/stm32l4.s
static const uint8_t loader_code_stm32l4[] = {
    0xdf, 0xf8, 0x28, 0xc0,
    0xdf, 0xf8, 0x28, 0xa0,
    0xe2, 0x44, 0x05, 0x68,
    0x44, 0x68, 0x0d, 0x60,
    0x4c, 0x60, 0x00, 0xf1,
    0x08, 0x00, 0x01, 0xf1,
    0x08, 0x01, 0xda, 0xf8,
    0x00, 0x40, 0x14, 0xf4,
    0x80, 0x3f, 0xfa, 0xd1,
    0x08, 0x3a, 0xf0, 0xdc,
    0x00, 0xbe, 0x00, 0xbf,
    0x00, 0x20, 0x02, 0x40,
    0x10, 0x00, 0x00, 0x00
};

// flashloaders/stm32f7.s
static const uint8_t loader_code_stm32f7[] = {
    0xdf, 0xf8, 0x28, 0xc0,
    0xdf, 0xf8, 0x28, 0xa0,
    0xe2, 0x44, 0x04, 0x68,
    0x0c, 0x60, 0x00, 0xf1,
    0x04, 0x00, 0x01, 0xf1,
    0x04, 0x01, 0xbf, 0xf3,
    0x4f, 0x8f, 0xba, 0xf8,
    0x00, 0x40, 0x14, 0xf0,
    0x01, 0x0f, 0xfa, 0xd1,
    0x04, 0x3a, 0xf0, 0xdc,
    0x00, 0xbe, 0x00, 0xbf,
    0x00, 0x3c, 0x02, 0x40,
    0x0e, 0x00, 0x00, 0x00
};

// flashloaders/stm32f7lv.s
static const uint8_t loader_code_stm32f7_lv[] = {
    0xdf, 0xf8, 0x28, 0xc0,
    0xdf, 0xf8, 0x28, 0xa0,
    0xe2, 0x44, 0x04, 0x78,
    0x0c, 0x70, 0x00, 0xf1,
    0x01, 0x00, 0x01, 0xf1,
    0x01, 0x01, 0xbf, 0xf3,
    0x4f, 0x8f, 0xba, 0xf8,
    0x00, 0x40, 0x14, 0xf0,
    0x01, 0x0f, 0xfa, 0xd1,
    0x01, 0x3a, 0xf0, 0xdc,
    0x00, 0xbe, 0x00, 0xbf,
    0x00, 0x3c, 0x02, 0x40,
    0x0e, 0x00, 0x00, 0x00
};

// flashloaders/mdr32.s -- Milandr 1986VE9x (MDR32) EEPROM/flash controller.
// Programs one 32-bit word at a time with the required software delays
// (the controller has no BUSY flag). Arguments: r0 = src, r1 = dst,
// r2 = byte count (multiple of 4). The controller is unlocked and its CON
// bit is set inside the loader, then relocked before the final bkpt.
static const uint8_t loader_code_mdr32[] = {
    0x19, 0x4b, 0x1a, 0x4c,
    0x1c, 0x61, 0x1c, 0x68,
    0x38, 0x25, 0x2c, 0x40,
    0x01, 0x25, 0x2c, 0x43,
    0x1c, 0x60, 0x59, 0x60,
    0x05, 0x68, 0x9d, 0x60,
    0x15, 0x4d, 0x2c, 0x43,
    0x1c, 0x60, 0x0e, 0x25,
    0x01, 0x3d, 0xfd, 0xd1,
    0x13, 0x4d, 0x2c, 0x43,
    0x1c, 0x60, 0x1b, 0x25,
    0x01, 0x3d, 0xfd, 0xd1,
    0x80, 0x25, 0x2c, 0x43,
    0x1c, 0x60, 0x6b, 0x25,
    0x01, 0x3d, 0xfd, 0xd1,
    0x80, 0x25, 0xac, 0x43,
    0x1c, 0x60, 0x0d, 0x4d,
    0xac, 0x43, 0x1c, 0x60,
    0x0e, 0x25, 0x01, 0x3d,
    0xfd, 0xd1, 0x0b, 0x4d,
    0xac, 0x43, 0x1c, 0x60,
    0x04, 0x30, 0x04, 0x31,
    0x04, 0x3a, 0xda, 0xdc,
    0x38, 0x25, 0x2c, 0x40,
    0x1c, 0x60, 0x00, 0x25,
    0x1d, 0x61, 0x00, 0xbe,
    0x00, 0x80, 0x01, 0x40,
    0x51, 0x55, 0xaa, 0x8a,
    0x40, 0x10, 0x00, 0x00,
    0x00, 0x20, 0x00, 0x00,
    0x00, 0x10, 0x00, 0x00,
    0x40, 0x20, 0x00, 0x00
};


int32_t stlink_flash_loader_init(stlink_t *sl, flash_loader_t *fl) {
    uint32_t size = 0;
    uint32_t dfsr, cfsr, hfsr;

    /* Interrupt masking according to DDI0419C, Table C1-7 firstly force halt */
    stlink_write_debug32(sl, STLINK_REG_DHCSR,
                           STLINK_REG_DHCSR_DBGKEY | STLINK_REG_DHCSR_C_DEBUGEN |
                           STLINK_REG_DHCSR_C_HALT);
    /* and only then disable interrupts */
    stlink_write_debug32(sl, STLINK_REG_DHCSR,
                           STLINK_REG_DHCSR_DBGKEY | STLINK_REG_DHCSR_C_DEBUGEN |
                           STLINK_REG_DHCSR_C_HALT | STLINK_REG_DHCSR_C_MASKINTS);

    // allocate the loader in SRAM
    if (stlink_flash_loader_write_to_sram(sl, &fl->loader_addr, &size) == -1) {
        WLOG("Failed to write flash loader to sram!\n");
        return (-1);
    }

    // allocate a one page buffer in SRAM right after loader
    fl->buf_addr = fl->loader_addr + size;
    ILOG("Successfully loaded flash loader in sram\n");

    // set address of IWDG key register for reset it
    if (sl->flash_type == STM32_FLASH_TYPE_H7) {
        fl->iwdg_kr = STM32H7_WDG_KR;
    } else if (sl->flash_type == MDR32_FLASH_TYPE) {
        fl->iwdg_kr = 0; // watchdog reset not needed for MDR32
    } else {
        fl->iwdg_kr = STM32F0_WDG_KR;
    }

